app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    if params[:movie_title]
      @movies = Movie.all.sort_by(&:title)