app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13')
---
  def index

    @all_ratings = Movie.get_all_ratings

    if params[:ratings]
      @ratings = params[:ratings].keys
    else
      @ratings = @all_ratings
    end


    @movies = Movie.where(rating: @ratings)